# Модуль 3 урок №6. "Произвольное число параметров и HTML_DOM"

def test(a, *b, c='Текст', **d):
    print('Первый аргумент:', a)
    print('Второй аргумент:', b)
    print('Третий аргумент:', c)
    print('Четвертый аргумент:', d)


def factorial(n):
    if n == 0:
        return 0
    else:
        return n + factorial(n - 1)


list1 = ['Один', 'Два', 'Три']
dict1 = {'Арбуз': 'Красный', 'Яблоко': 'Зеленое', 'Абрикос': 'Желтый'}
print('Первый вызов функции test')
test(1, 2, 3, 4, 5, 6, 7, c='Привет', a1=15, b1=16, c1=17, d1=18)
print('Второй вызов функции test')
test(1, *list1, **dict1)
print('Рекурсивная функция, расчет факториала числа')
print('Факториал числа', factorial(6))
